#### Terraform Format and Style 🖌\`success\`
#### Terraform Initialization ⚙️\`success\`
#### Terraform Plan 📖\`success\`
#### Terraform Validation 🤖\`success\`

<details><summary>Show Plan</summary>

\`\`\`terraform\n
module.lending_originations.data.external.phase_outcomes_bq_schema: Reading...
module.lending_originations.data.external.policy_rule_results_bq_schema: Reading...
module.lending_originations.data.external.policy_rule_results_bq_schema: Read complete after 1s [id=-]
module.lending_originations.data.external.phase_outcomes_bq_schema: Read complete after 1s [id=-]
data.google_project.project: Reading...
module.lending_originations.data.google_project.project: Reading...
module.lending_originations.google_pubsub_schema.policy_rule_results: Refreshing state... [id=projects/firebase-svelte-381023/schemas/policy_rule_results]
module.lending_originations.google_bigquery_dataset.lending_originations: Refreshing state... [id=projects/firebase-svelte-381023/datasets/lending_originations]
module.lending_originations.google_pubsub_topic.policy_rule_results: Refreshing state... [id=projects/firebase-svelte-381023/topics/policy_rule_results_topic]
module.lending_originations.data.google_project.project: Read complete after 0s [id=projects/firebase-svelte-381023]
module.lending_originations.google_project_iam_member.editor: Refreshing state... [id=firebase-svelte-381023/roles/bigquery.dataEditor/serviceAccount:service-251894369022@gcp-sa-pubsub.iam.gserviceaccount.com]
module.lending_originations.google_project_iam_member.viewer: Refreshing state... [id=firebase-svelte-381023/roles/bigquery.metadataViewer/serviceAccount:service-251894369022@gcp-sa-pubsub.iam.gserviceaccount.com]
data.google_project.project: Read complete after 0s [id=projects/firebase-svelte-381023]
module.lending_originations.google_bigquery_table.policy_rule_results: Refreshing state... [id=projects/firebase-svelte-381023/datasets/lending_originations/tables/policy_rule_results]
module.lending_originations.google_pubsub_subscription.policy_rule_results: Refreshing state... [id=projects/firebase-svelte-381023/subscriptions/policy_rule_results_subscription]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.lending_originations.google_bigquery_table.phase_outcomes will be created
  + resource "google_bigquery_table" "phase_outcomes" {
      + creation_time       = (known after apply)
      + dataset_id          = "lending_originations"
      + deletion_protection = false
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = (known after apply)
      + schema              = jsonencode(
            [
              + {
                  + name = "event_time"
                  + type = "TIMESTAMP"
                },
              + {
                  + name = "reference_id"
                  + type = "STRING"
                },
              + {
                  + name = "phase"
                  + type = "STRING"
                },
              + {
                  + name = "outcome"
                  + type = "STRING"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "phase_outcomes"
      + type                = (known after apply)
    }

  # module.lending_originations.google_pubsub_schema.phase_outcomes will be created
  + resource "google_pubsub_schema" "phase_outcomes" {
      + definition = jsonencode(
            {
              + fields = [
                  + {
                      + name = "event_time"
                      + type = "string"
                    },
                  + {
                      + name = "reference_id"
                      + type = "string"
                    },
                  + {
                      + name = "phase"
                      + type = "string"
                    },
                  + {
                      + name = "outcome"
                      + type = "string"
                    },
                ]
              + name   = "Avro"
              + type   = "record"
            }
        )
      + id         = (known after apply)
      + name       = "phase_outcomes"
      + project    = (known after apply)
      + type       = "AVRO"
    }

  # module.lending_originations.google_pubsub_subscription.phase_outcomes will be created
  + resource "google_pubsub_subscription" "phase_outcomes" {
      + ack_deadline_seconds       = 15
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "phase_outcomes_subscription"
      + project                    = (known after apply)
      + topic                      = "phase_outcomes_topic"

      + bigquery_config {
          + drop_unknown_fields = true
          + table               = (known after apply)
          + use_topic_schema    = true
          + write_metadata      = false
        }
    }

  # module.lending_originations.google_pubsub_topic.phase_outcomes will be created
  + resource "google_pubsub_topic" "phase_outcomes" {
      + id      = (known after apply)
      + name    = "phase_outcomes_topic"
      + project = (known after apply)

      + schema_settings {
          + encoding = "JSON"
          + schema   = "projects/firebase-svelte-381023/schemas/phase_outcomes"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

\`\`\`

</details>